src/InformationRegisters/УведомленияПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УведомленияПользователей</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекстУведомления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прочитано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПрочтения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обработано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ITЗаявка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипУведомления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыУведомлений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/УправлениеУведомлениямиВызовСервера/Ext/Module.bsl
Функция ПолучитьНепоказанныеУведомления() Экспорт
	НепоказанныеУведомления = Новый Массив;
	ТекущийСотрудник = УправлениеПользователямиСервер.ПолучитьТекущегоСотрудника();

	Если ТекущийСотрудник = Неопределено Тогда
		Возврат НепоказанныеУведомления;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УведомленияПользователей.Период КАК Период,
		|	УведомленияПользователей.Заявка КАК Заявка,
		|	УведомленияПользователей.ТипУведомления КАК ТипУведомления,
		|	УведомленияПользователей.ТекстУведомления КАК ТекстУведомления
		|ИЗ
		|	РегистрСведений.УведомленияПользователей КАК УведомленияПользователей
		|ГДЕ
		|	УведомленияПользователей.Получатель = &Получатель 
		|	И УведомленияПользователей.Прочитано = ЛОЖЬ   
		|	И УведомленияПользователей.Обработано = ЛОЖЬ
		|	И УведомленияПользователей.ДатаПоказа = &ПустаяДата
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период ВОЗР";
	
	Запрос.УстановитьПараметр("Получатель", ТекущийСотрудник);
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1, 1, 1));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		УведомлениеПользователя = Новый Структура;
		УведомлениеПользователя.Вставить("Период", Выборка.Период);
		УведомлениеПользователя.Вставить("Заявка", Выборка.Заявка);
		УведомлениеПользователя.Вставить("ТипУведомления", Выборка.ТипУведомления);
		УведомлениеПользователя.Вставить("ТекстУведомления", Выборка.ТекстУведомления);
		НепоказанныеУведомления.Добавить(УведомлениеПользователя);
	КонецЦикла;

    Возврат НепоказанныеУведомления;
КонецФункции

Функция ОтметитьУведомленияПоказанными(Уведомления) Экспорт
	
	Возврат УправлениеУведомлениямиСервер.ОтметитьУведомленияПоказанными(Уведомления);
	
КонецФункции

Функция ОтметитьУведомлениеПрочитанным(Период, Заявка, ТипУведомления) Экспорт
	
	Возврат УправлениеУведомлениямиСервер.ОтметитьУведомлениеПрочитанным(Период, Заявка, ТипУведомления);
	
КонецФункции
